update: landing page of the system & readme
